Revit 2027 API
TypeBinding Constructor
Constructs an empty type binding.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TypeBinding()
Public Sub New
public:
TypeBinding()
new : unit -> TypeBinding
Remarks
Categories can be set a later time by using the Categories property of this object.
See Also
Reference
TypeBinding Class
TypeBinding Overload
Autodesk.Revit.DB Namespace